# DividedSurfaceSplitRefInvisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceSplitRefInvisible Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
Some of the splitting references of this Divided Surface are invisible in the current view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceSplitRefInvisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceSplitRefInvisible As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceSplitRefInvisible {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace